/*
Navicat MySQL Data Transfer

Source Server         : localhost_3306
Source Server Version : 50505
Source Host           : localhost:3306
Source Database       : search_topic

Target Server Type    : MYSQL
Target Server Version : 50505
File Encoding         : 65001

Date: 2019-10-31 21:11:44
*/

SET FOREIGN_KEY_CHECKS=0;
-- ----------------------------
-- Table structure for `topic`
-- ----------------------------
DROP TABLE IF EXISTS `topic`;
CREATE TABLE `topic` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `topic` text NOT NULL COMMENT '题目',
  `name` varchar(30) NOT NULL,
  `telephone` char(11) NOT NULL,
  `content` text,
  `time` timestamp NULL DEFAULT NULL ON UPDATE CURRENT_TIMESTAMP,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=39 DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of topic
-- ----------------------------
INSERT INTO `topic` VALUES ('7', '学生管理系统', 'admin', '14781828227', '1.能按班级、按课程完成对学生成绩的增删改查；\r\n2.能按班级、按课程统计学生的成绩，能求总分、平均分，课程的不及格人数等；\r\n3.能按班级、按课程对学生的成绩进行排序；\r\n4.能查询某名学生的成绩。\r\n5.论文要救思路清晰，结构合理，语言流畅，书写格式符合要求。', '2019-10-31 20:22:31');
INSERT INTO `topic` VALUES ('8', '财务管理系统', 'admin', '14781828227', '1.能添加用户基本信息；\r\n2.能导入用户财务信息；\r\n3.能导出用户财务记录；\r\n4.能对用户月收支、年收支进行查询；\r\n5.论文要救思路清晰，结构合理，语言流畅，书写格式符合要求。', '2019-10-31 20:22:34');
INSERT INTO `topic` VALUES ('9', '智能停车系统', 'admin', '14781828227', '1.出入口控制机用于验证车辆通行权限，并具备刷长期卡、发放临时卡的功能；\r\n2.蓝牙远距离读卡器，进出车辆使用远距离蓝牙卡读卡进出；\r\n3.IC/蓝牙发卡器用于注册授权员工/业主/临时卡；\r\n4.余位显示屏能实现余位显示功能；\r\n5.自助缴费机实现自助缴费功能；\r\n6.管理平台能实现系统设备统一管理，以及业务应用。\r\n7.论文要救思路清晰，结构合理，语言流畅，书写格式符合要求。', '2019-10-31 20:22:56');
INSERT INTO `topic` VALUES ('11', '基于zigbee的智能家居设计与实现', 'admin', '14781828227', '1.利用网页和手机两种远程控制方式，结合PC机，再将CC2430无线ZigBee模块、ATMega128单片机、射频身份识别（RFID）模块和全球数字移动电话系统（GSM）模块组成系统控制中心，通过无线ZigBee网络，Internet和GSM网络完成对室内所有监控节点、选择添加的家用电器的本地和远程控制，从而为用户提供一种智能、灵活、方便的生活空间。该系统设计具有添加新设备灵活，远程控制方便和个人信息管理智能等优点。\r\n2.给出硬件实现电路图及软件程序\r\n3.论文要救思路清晰，结构合理，语言流畅，书写格式符合要求。', '2019-10-31 20:23:36');
INSERT INTO `topic` VALUES ('12', '基于物联网温度控制系统', 'admin', '14781828227', '1.采用箔电阻、精密电阻及电位器组成测量电桥作为温度传感器，要求温度测量范围为0℃-100℃；\r\n2.要求温度超过40摄氏度时报警；\r\n3.当检测温度超过设定上限值时，发出蜂鸣器报警声，要求报警声喃喃间断发声，频率约1Hz；\r\n4.论文要救思路清晰，结构合理，语言流畅，书写格式符合要求。', '2019-10-31 20:23:57');
INSERT INTO `topic` VALUES ('13', '基于物联网的温湿度管理系统', 'admin', '14781828227', '1.搭建一个基于物联网的温湿度采集系统，实现两个终端节点（通过修改程序可增加节点数）将传感器测得的数据传给协调器，由协调器将接收到的数据通过OLED显示，可通过串口在PC端上位机显示，当测得终端的温度超过一定的数值时，继电器吸合，可应用于控温系统。\r\n2.给出硬件实现电路图及软件程序\r\n3.论文要救思路清晰，结构合理，语言流畅，书写格式符合要求。', '2019-10-31 20:24:10');
INSERT INTO `topic` VALUES ('14', '基于单片机的流水灯设计', 'admin', '14781828227', '1.以AT公司的芯片AT89C51单片机来实现流水灯的设计。\r\n2.给出硬件实现电路图及软件程序\r\n3.论文要救思路清晰，结构合理，语言流畅，书写格式符合要求。', '2019-10-31 20:24:21');
INSERT INTO `topic` VALUES ('15', '食堂用餐管理系统', 'admin', '14781828227', '1.基于Arduino和树莓派高校食堂就餐服务与管理系统。\r\n2.给出硬件实现电路图及软件程序\r\n3.论文要救思路清晰，结构合理，语言流畅，书写格式符合要求。', '2019-10-31 20:24:30');
INSERT INTO `topic` VALUES ('16', '基于web的电子商城', 'admin', '14781828227', '1.采用基于J2EE的Web Services技术，结合标准的Web协议（HTTP、SMTP等）和XML、SOAP、WSDL、VDDI等一系列标准，给出一个企业电子商务应用集成技术的设计与实现。\r\n2.给出硬件实现电路图及软件程序\r\n3.论文要救思路清晰，结构合理，语言流畅，书写格式符合要求。', '2019-10-31 20:24:40');
INSERT INTO `topic` VALUES ('17', '学籍管理系统', 'admin', '14781828227', '1.利用VisualFoxPro实现了学籍系统后台数据库的建立和前端界面的开发，包括个人信息管理、成绩管理、统计查询管理和用户系统管理等，实现了相关信息的增加、删除、查询和修改等功能。\r\n2.给出硬件实现电路图及软件程序\r\n3.论文要救思路清晰，结构合理，语言流畅，书写格式符合要求。', '2019-10-31 20:24:50');
INSERT INTO `topic` VALUES ('18', '基于Android的安防报警系统', 'admin', '14781828227', '1.设计一个基于Android平台的智能家居安防系统的总体设计方案,根据设计方案给出了软件的基本模块结构,然后对每个软件模块给出了具体实现。\r\n2.给出硬件实现电路图及软件程序\r\n3.论文要救思路清晰，结构合理，语言流畅，书写格式符合要求。', '2019-10-31 20:25:04');
INSERT INTO `topic` VALUES ('19', '基于物联网的窗帘控制设计与实现', 'admin', '14781828227', '1．要求自选方案完成基于物联网的窗帘控制系统设计； \r\n2．要求采用软、硬结合的方式完成系统电路的设计； \r\n3.要求室内温度、亮度等环境条件实现对窗帘的控制；\r\n4.要求完成系统硬件电路的搭建和系统整体测试，实现对窗帘的智能控制功能。\r\n5.论文要救思路清晰，结构合理，语言流畅，书写格式符合要求。', '2019-10-31 20:25:15');
INSERT INTO `topic` VALUES ('20', 'GPS定位的设计与实现', 'admin', '14781828227', '1.基于Android平台的GPS系统,对各主要功能模块进行了详细的研究和分析。\r\n2.给出硬件实现电路图及软件程序\r\n3.论文要救思路清晰，结构合理，语言流畅，书写格式符合要求。', '2019-10-31 20:25:28');
INSERT INTO `topic` VALUES ('21', '仓库温湿度设计与实现', 'admin', '14781828227', '1.要求采用单总线传感器网络和RS485传输网络的设计思想，将温度、湿度传感器多条单总线汇总到一起，由一台数据采集器集中控制，每台数据采集器负责一定区域内的温湿度监测。\r\n2.要求各采集器以网络结点的方式挂接到RS485传输网络上；\r\n3.系统中为主机与各采集器之间的数据通信制定完备的通信协议\r\n4.论文要救思路清晰，结构合理，语言流畅，书写格式符合要求。', '2019-10-31 20:25:41');
INSERT INTO `topic` VALUES ('22', '基于单片机的远程监控火灾系统', 'admin', '14781828227', '1.基于KeilC开发系统的嵌入式网关应用于火灾报警远程监控系统的设计方案,使火灾报警系统(FAS)可以方便地通过Internet互联,实现对FAS的远程监控。\r\n2.给出硬件实现电路图及软件程序\r\n3.论文要救思路清晰，结构合理，语言流畅，书写格式符合要求。', '2019-10-31 20:25:50');
INSERT INTO `topic` VALUES ('23', '电梯的自动控制', 'admin', '14781828227', '1.以89C52单片机为核心控制器件的电梯自动控制系统,该系统采用单片机作为控制核心,通过扫描内外按键按下与否引起的电平的改变,作为用户请求信息发送到单片机,控制电动机转动,单片机根据楼层检测结果控制电机停在目标楼层。\r\n2.给出硬件实现电路图及软件程序\r\n3.论文要救思路清晰，结构合理，语言流畅，书写格式符合要求。', '2019-10-31 20:26:00');
INSERT INTO `topic` VALUES ('24', '交通灯的监控设计与实现', 'admin', '14781828227', '1.以STC89C52作为系统控制器,远程PC机作为上位机,使用GTM900C作为系统的GPRS模块完成数据的无线传输;用户可通过手机短信获取远程数据,也可通过PC机上的监控界面获取数据和交通灯当前信息。\r\n2.给出硬件实现电路图及软件程序\r\n3.论文要救思路清晰，结构合理，语言流畅，书写格式符合要求。', '2019-10-31 20:26:12');
INSERT INTO `topic` VALUES ('25', '数字显示电子秤的设计', 'admin', '14781828227', '1.利用MCU单片机设计数字显示电子秤，,该电子秤具有基本检测重量、计算物品价格、键盘输入物品单价、显示物品重量和总金额、物品超重报警功能。\r\n2.给出硬件实现电路图及软件程序\r\n3.论文要救思路清晰，结构合理，语言流畅，书写格式符合要求。', '2019-10-31 20:26:25');
INSERT INTO `topic` VALUES ('26', '超声波测距的设计与实现', 'admin', '14781828227', '1.基于超声波测距原理,利用温度、湿度双补偿方法,设计并实现了一种新型多功能测距仪。\r\n2.给出硬件实现电路图及软件程序\r\n3.论文要救思路清晰，结构合理，语言流畅，书写格式符合要求。', '2019-10-31 20:26:35');
INSERT INTO `topic` VALUES ('27', '数字显示金属探测器的设计', 'admin', '14781828227', '1.完成电路设计方案的选择；\r\n2.单元电路的设计；\r\n3.整机电路的原理分析；\r\n4.电路事物的制作；\r\n5.论文要救思路清晰，结构合理，语言流畅，书写格式符合要求。', '2019-10-31 20:26:45');
INSERT INTO `topic` VALUES ('32', '基于单片机的红外探测仪设计', 'admin', '14781828227', '1.基于STC89C52单片机设计的红外测距仪,可以测量短距离,利用GP2Y0A21YK0F传感器作为测量组件,设计红外测距仪。\r\n2.给出硬件实现电路图及软件程序\r\n3.论文要救思路清晰，结构合理，语言流畅，书写格式符合要求。', '2019-10-31 20:26:54');
INSERT INTO `topic` VALUES ('36', '基于zigbee的近距离无线通信设计', 'admin', '14781828227', '1.实现短距离范围内的无线定位。在此基础上,对无线网络系统的硬件进行了研究与设计,软件上进行了无线通信应用程序的开发,并通过图形显示软件对设计的网络系统进行实时定位显示。\r\n2.给出硬件实现电路图及软件程序\r\n3.论文要救思路清晰，结构合理，语言流畅，书写格式符合要求。', '2019-10-31 20:27:04');
INSERT INTO `topic` VALUES ('37', '基于单片机的红绿灯控制', 'admin', '14781828227', '1.采用MSC-51系列单片机ATSC51和可编程并行IO接口芯片设计交通灯控制器；\r\n2.红绿灯循环点亮，倒计时剩5秒时黄灯闪烁警示；\r\n3.论文要救思路清晰，结构合理，语言流畅，书写格式符合要求。\r\n', null);
INSERT INTO `topic` VALUES ('38', '图书馆管理系统的设计与实现', 'admin', '14781828227', '1.设计前端的应用程序和后台的数据库建立和维护。\r\n2.给出硬件实现电路图及软件程序\r\n3.论文要救思路清晰，结构合理，语言流畅，书写格式符合要求。\r\n', null);
